/*Опис:
Створити PL-SQL блок, який в залежності ві д дати, показує нам чи буде сьогодні виплата зарплати,
авансу або взагалі треба ще почекати.
Деталі :
Допустимо виплата зарплати у нас в останні й день кожного мі сяця, а виплата авансу кожного 15-го
числа.
Заведі ть змі нну v_date типу date і ві дразу присвойте ці й змі нні й якусь дату (наприклад
TO_DATE('30.04.2023', 'DD.MM.YYYY')). Також заведі ть змі нну v_day типу number. Далі в середині блоку,
змі нні й v_day присвойте значення по формулі - to_number(to_char(v_date, 'dd')). Далі по коду, зробі ть
розгалуження через оператора IF, і якщо змі нна v_date дорі внює останньому дню в мі сяці
(last_day(trunc(SYSDATE))), то виведі ть текст "Виплата зарплати", якщо змі нна v_day дорі внює 15, то
виведі ть текст "Виплата авансу", якщо змі нна v_day меньша за 15, то виведі ть текст "Чекаємо на аванс", а
якщо змі нна v_day бі льша за 15, то виведі ть текст "Чекаємо на зарплату". Блок і накше нам не потрі бен.
Переві рте як працює ваш PL-SQL блок з рі зною датою в змі нні й v_date.*/

DECLARE
    v_date date := TO_DATE('11.07.2026', 'DD.MM.YYYY');
    v_day NUMBER;
BEGIN
    v_day := to_number(to_char(v_date, 'dd'));
    IF v_date = (last_day(trunc(SYSDATE))) THEN
        dbms_output.put_line('Виплата зарплати');
    ElSIF v_day = 15 THEN
        dbms_output.put_line('Виплата авансу'); 
    ELSIF v_day > 15 THEN
        dbms_output.put_line('Чекаємо на зарплату');
    END IF;
END;
/