/*Створити PL-SQL блок, який в залежності ві д року показує, це високосний рі к чи ні .
Деталі :
Будь-який рі к, який ді литься на 4 без залишку, є високосним роком. Наприклад: 2012, 2016 та 2020 роки
є високосними роками.
Заведі ть дві змі нні v_year та v_check_year типу даних number. Змі нні й v_year ві дразу присвойте
якийсь рі к (наприклад 2012). Далі в середині блоку, змі нні й v_check_year присвойте значення по
формулі - mod(v_year, 4). Далі по коду, зробі ть розгалуження через оператора IF, і якщо змі нна
v_check_year=0, то виведі ть текст "Високосний рі к", а і накше "Не високосний рі к". Переві рте як
працює ваш PL-SQL блок з і ншими значеннями в змі нні й v_year.*/

DECLARE
v_year NUMBER := 2012; --2019
v_check_year NUMBER;
BEGIN
     v_check_year  := mod(v_year, 4);
    IF v_check_year = 0 THEN
        dbms_output.put_line('Високосний рік');
    ElSIF v_check_year != 0 THEN
        dbms_output.put_line('Не високосний рік'); -- зверніть увагу на екранування
    
    END IF;
END;
/