/*Створити окрему процедуру переві рки робочих дні в. Для використання її в потрі бних мі сцях, щоб 
не дублювати код.
Деталі :
Створити окрему процедуру (без вхі дних чи вихі дних параметрі в) в check_work_time, 
взяти готовий код з процедури util.add_new_jobs.
Тобто, при виклику процедури, повинно переві рятися який сьогодні
день, і якщо сьогодні субота або неді ля процедура повинна генерувати код помилки -20205 
та текст помилки "Ви можете вносити змі ни лише у робочі дні ". Процедуру check_work_time помі 
стити ті льки в body пакета util.
В процедурі util.add_new_jobs викорастити процедуру check_work_time замі сть коду який 
був на мі сці переві рки робочих дні в.
Зберегти код для оголошення процедури check_work_time в пакеті util, у
файл пі д назвою H_04_01_tvoji_inichialy.sql. Загрузити в LMS Moodle*/

CREATE OR REPLACE PROCEDURE check_work_time 
IS
BEGIN
    IF TO_CHAR(SYSDATE, 'DY', 'NLS_DATE_LANGUAGE = AMERICAN') IN ('SAT', 'SUN') THEN
        raise_application_error(-20205, 'Ви можете вносити зміни лише у робочі дні');
    END IF;
END check_work_time;
/


--виклик процедури

DECLARE
    
BEGIN
    check_work_time;      
END;
/